export interface IIntroduce {
  contents: string[];
}

const introduce: IIntroduce = {
  contents: [
    '저는 코드에 항상 "왜?"라는 질문을 던지며 더 나은 솔루션을 찾아가는 개발자입니다. 개발 과정에서 단순히 작동하는 코드를 넘어, 코드의 구조와 선택이 가지는 의미를 깊이 고민합니다. 이러한 자세는 효율적이고 확장 가능한 코드를 작성하는 데 큰 힘이 된다고 생각합니다.',
    '저는 커뮤니티와의 원활한 의사소통이 얼마나 중요한지 깊이 이해하고 있습니다. 협업에서의 명확한 커뮤니케이션은 프로젝트의 성공을 좌우하는 중요한 요소라고 믿습니다. 개발자, 디자이너, 그리고 다른 이해 관계자들과의 협업 경험을 통해 다양한 관점을 이해하고 통합하는 능력을 키웠습니다.',
    '또한, 스타트업에서의 다양한 경험은 제 성장에 큰 자양분이 되었습니다. 제한된 리소스와 빠르게 변화하는 환경 속에서 문제를 해결하고, 새로운 기술을 배우며, 사용자의 니즈를 만족시키는 제품을 만드는 법을 배웠습니다. 이런 경험은 저를 도전적이고 유연한 개발자로 성장하게 했습니다.',
    '저는 항상 새로운 기술과 도구에 관심을 갖고, 지속적인 학습을 추구합니다. 새로운 기술을 배우는 것은 어렵지만, 그만큼 즐겁고 보람있는 일이라고 생각합니다. 끊임없는 도전을 통해 더 나은 개발자로 성장하고, 더 나은 솔루션을 만들어내기 위해 노력하겠습니다.',
  ],
};

export default introduce;
