export interface IIntroduce {
  contents: string[];
}

const introduce: IIntroduce = {
  contents: [
    '다양한 기술 스택과 프로젝트를 통해 빠르게 적응하고 성장해 온 개발자입니다. 스타트업 회사에서 자체 프레임워크을 활용한 개발부터, Flutter로 모바일 앱을 구현하며 플랫폼을 넘나드는 개발 경험을 쌓았습니다. 특히 React를 활용한 테일즈런너 웹 및 어드민 프로젝트에서는, 사용자 경험을 고려한 UI/UX 설계와 안정적인 기능 구현을 통해 높은 품질의 결과물을 만들어냈습니다. 새로운 기술에 대한 빠른 학습 능력과 다양한 개발 환경에서의 협업 경험을 바탕으로, 사용자와 비즈니스의 요구를 해결하는 데 강점을 가지고 있습니다.',
    '커뮤니티와의 원활한 의사소통이 얼마나 중요한지 깊이 이해하고 있습니다. 협업에서의 명확한 커뮤니케이션은 프로젝트의 성공을 좌우하는 중요한 요소라고 믿습니다. 개발자, 디자이너, 그리고 다른 이해 관계자들과의 협업 경험을 통해 다양한 관점을 이해하고 통합하는 능력을 키웠습니다.',
    '또한, 스타트업에서의 다양한 경험은 제 성장에 큰 자양분이 되었습니다. 제한된 리소스와 빠르게 변화하는 환경 속에서 문제를 해결하고, 새로운 기술을 배우며, 사용자의 니즈를 만족시키는 제품을 만드는 법을 배웠습니다. 이런 경험은 도전적이고 유연한 개발자로 성장하게 했습니다.',
  ],
};

export default introduce;
